<?php
global $product;
?>
<article class="product-card product-card-catalog">
    <?php echo $product->get_image('full', array('class' => 'product-card__image')); ?>
    <div class="product-card__content">
        <a href="<?php echo get_permalink(); ?>">
            <p class="product-card__name"><?php the_title(); ?></p>
        </a>
        <div class="product-card__availability">
            <?php
            if ($product->is_in_stock()) {
                echo '<p class="in-stock">В наличии</p>';
            } elseif ($product->is_on_backorder()) {
                echo '<p class="on-backorder">Под заказ</p>';
            } else {
                echo '<p class="out-of-stock">Нет в наличии</p>';
            }
            ?>
        </div>

        <?php
        // Реальная цена товара
        if ($product->is_on_sale()) {
            ?>
            <div class="product-card__price product-card__price-sale">
                <span class="product-card__sale">
                    <span class="product-card__sale-label">
                        <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M9.11088 1.44033C8.81866 1.68936 8.67253 1.8139 8.51647 1.91849C8.15875 2.15825 7.75701 2.32465 7.33452 2.40807C7.15021 2.44446 6.95884 2.45973 6.5761 2.49027C5.61444 2.56702 5.1336 2.60538 4.73245 2.74708C3.80461 3.0748 3.0748 3.80461 2.74708 4.73245C2.60538 5.1336 2.56702 5.61444 2.49027 6.5761C2.45973 6.95884 2.44446 7.15021 2.40807 7.33452C2.32465 7.75701 2.15825 8.15875 1.91849 8.51647C1.8139 8.67253 1.68937 8.81864 1.44033 9.11088C0.814599 9.84516 0.501723 10.2122 0.318267 10.5961C-0.106089 11.484 -0.106089 12.516 0.318267 13.4039C0.501735 13.7878 0.814599 14.1548 1.44033 14.8891C1.68934 15.1813 1.8139 15.3275 1.91849 15.4835C2.15825 15.8412 2.32465 16.243 2.40807 16.6655C2.44446 16.8498 2.45973 17.0412 2.49027 17.4239C2.56702 18.3856 2.60538 18.8664 2.74708 19.2676C3.0748 20.1954 3.80461 20.9252 4.73245 21.253C5.1336 21.3946 5.61444 21.433 6.5761 21.5098C6.95884 21.5402 7.15021 21.5556 7.33452 21.592C7.75701 21.6754 8.15875 21.8418 8.51647 22.0816C8.67253 22.1861 8.81864 22.3106 9.11088 22.5596C9.84516 23.1854 10.2122 23.4983 10.5961 23.6818C11.484 24.1061 12.516 24.1061 13.4039 23.6818C13.7878 23.4983 14.1548 23.1854 14.8891 22.5596C15.1813 22.3106 15.3275 22.1861 15.4835 22.0816C15.8412 21.8418 16.243 21.6754 16.6655 21.592C16.8498 21.5556 17.0412 21.5402 17.4239 21.5098C18.3856 21.433 18.8664 21.3946 19.2676 21.253C20.1954 20.9252 20.9252 20.1954 21.253 19.2676C21.3946 18.8664 21.433 18.3856 21.5098 17.4239C21.5402 17.0412 21.5556 16.8498 21.592 16.6655C21.6754 16.243 21.8418 15.8412 22.0816 15.4835C22.1861 15.3275 22.3106 15.1813 22.5596 14.8891C23.1854 14.1548 23.4983 13.7878 23.6818 13.4039C24.1061 12.516 24.1061 11.484 23.6818 10.5961C23.4983 10.2122 23.1854 9.84516 22.5596 9.11088C22.3106 8.81864 22.1861 8.67253 22.0816 8.51647C21.8418 8.15875 21.6754 7.75701 21.592 7.33452C21.5556 7.15021 21.5402 6.95884 21.5098 6.5761C21.433 5.61444 21.3946 5.1336 21.253 4.73245C20.9252 3.80461 20.1954 3.0748 19.2676 2.74708C18.8664 2.60538 18.3856 2.56702 17.4239 2.49027C17.0412 2.45973 16.8498 2.44446 16.6655 2.40807C16.243 2.32465 15.8412 2.15825 15.4835 1.91849C15.3275 1.8139 15.1813 1.68937 14.8891 1.44033C14.1548 0.814599 13.7878 0.501735 13.4039 0.318267C12.516 -0.106089 11.484 -0.106089 10.5961 0.318267C10.2122 0.501723 9.84516 0.814599 9.11088 1.44033ZM16.5971 7.40351C16.9784 7.78491 16.9784 8.40328 16.5971 8.78467L8.78404 16.5977C8.40264 16.9792 7.78427 16.9792 7.40287 16.5977C7.02148 16.2163 7.02148 15.598 7.40287 15.2166L15.2159 7.40351C15.5974 7.02211 16.2157 7.02211 16.5971 7.40351ZM16.5576 15.2561C16.5576 15.9752 15.9746 16.5582 15.2555 16.5582C14.5362 16.5582 13.9532 15.9752 13.9532 15.2561C13.9532 14.5369 14.5362 13.9538 15.2555 13.9538C15.9746 13.9538 16.5576 14.5369 16.5576 15.2561ZM8.74454 10.0474C9.46372 10.0474 10.0468 9.46435 10.0468 8.74518C10.0468 8.02601 9.46372 7.443 8.74454 7.443C8.02537 7.443 7.44237 8.02601 7.44237 8.74518C7.44237 9.46435 8.02537 10.0474 8.74454 10.0474Z" fill="#E8364B" />
                        </svg>
                    </span>
                    <span class="product-card__sale-value">
                        <?php 
                            if ($product->is_type('variable')) {
                                echo wc_price($product->get_variation_sale_price('min'));
                            } else {
                                echo wc_price($product->get_sale_price());
                            }
                        ?>
                    </span>
                </span>
                <span class="product-card__price-value">
                    <?php 
                        if ($product->is_type('variable')) {
                            echo wc_price($product->get_variation_regular_price('min'));
                        } else {
                            echo wc_price($product->get_regular_price());
                        }
                    ?>
                </span>
            <?php
        } else {
            // Обычная цена
            ?>
                <div class="product-card__price">
                    <span class="product-card__price-value">
                        <?php 
                            if ($product->is_type('variable')) {
                                echo wc_price($product->get_variation_price('min'));
                            } else {
                                echo wc_price($product->get_price());
                            }
                        ?>
                    </span>
                </div>
            <?php
        }
            ?>
            </div>
            <div class="product-card__buttons">
                <?php
                // Рабочая кнопка добавления в корзину
                if ($product->is_purchasable() && $product->is_in_stock()) {
                    echo apply_filters(
                        'woocommerce_loop_add_to_cart_link',
                        sprintf(
                            '<a href="%s" data-quantity="1" class="%s" %s>%s</a>',
                            esc_url($product->add_to_cart_url()),
                            esc_attr('product-card__button'),
                            $product->get_type() == 'simple' ? 'data-product_id="' . $product->get_id() . '" data-product_sku="' . $product->get_sku() . '"' : '',
                            esc_html('Добавить в корзину')
                        ),
                        $product
                    );
                } else {
                    echo '<a href="' . get_permalink() . '" class="product-card__button product-card__button--view">Подробнее</a>';
                }
                ?>

                <button class="product-card__favorite">
                    <svg viewBox="0 0 27 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M13.25 3.46424C10.7508 0.57516 6.57469 -0.317692 3.44338 2.32784C0.312054 4.97337 -0.128793 9.39654 2.33025 12.5255C4.37478 15.1268 10.5622 20.6136 12.5901 22.3894C12.817 22.5881 12.9304 22.6874 13.0628 22.7264C13.1782 22.7605 13.3046 22.7605 13.4202 22.7264C13.5525 22.6874 13.6658 22.5881 13.8928 22.3894C15.9207 20.6136 22.1081 15.1268 24.1527 12.5255C26.6117 9.39654 26.2246 4.94554 23.0395 2.32784C19.8543 -0.289863 15.7492 0.57516 13.25 3.46424Z"
                            fill="white" stroke="black" stroke-width="1.5"
                            stroke-linecap="round" stroke-linejoin="round" />
                    </svg>
                </button>
            </div>
    </div>
</article>